sorosaulong-ux/gd32-test-project/Library/gd32a7xx_qspi.h
/*!
    \file    gd32a7xx_qspi.h
    \brief   definitions for the QSPI

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_QSPI_H
#define GD32A7XX_QSPI_H

#include "gd32a7xx.h"

/* QSPI definitions */
#define QSPI                              QSPI_BASE
/* CPDM definitions */
#define CPDM_QSPI                         (QSPI_BASE + (uint32_t)0x400)        /*!< QSPI CPDM base address */

/* registers definitions */
#define QSPI_CTL                          REG32(QSPI + 0x00000000U)            /*!< QSPI control register */
#define QSPI_DCFG                         REG32(QSPI + 0x00000004U)            /*!< QSPI device configuration register */
#define QSPI_STAT                         REG32(QSPI + 0x00000008U)            /*!< QSPI status register */
#define QSPI_STATC                        REG32(QSPI + 0x0000000CU)            /*!< QSPI status clear register */
#define QSPI_DTLEN                        REG32(QSPI + 0x00000010U)            /*!< QSPI data length register */
#define QSPI_TCFG                         REG32(QSPI + 0x00000014U)            /*!< QSPI transfer configuration register */
#define QSPI_ADDR                         REG32(QSPI + 0x00000018U)            /*!< QSPI address register */
#define QSPI_ALTE                         REG32(QSPI + 0x0000001CU)            /*!< QSPI alternate bytes register */
#define QSPI_DATA                         REG32(QSPI + 0x00000020U)            /*!< QSPI data register */
#define QSPI_STATMK                       REG32(QSPI + 0x00000024U)            /*!< QSPI status mask register */
#define QSPI_STATMATCH                    REG32(QSPI + 0x00000028U)            /*!< QSPI status match register */
#define QSPI_INTERVAL                     REG32(QSPI + 0x0000002CU)            /*!< QSPI interval register */
#define QSPI_TMOUT                        REG32(QSPI + 0x00000030U)            /*!< QSPI timeout register */
#define QSPI_FLUSH                        REG32(QSPI + 0x00000034U)            /*!< QSPI FIFO flush register */
#define QSPI_TMR                          REG32(QSPI + 0x00000038U)            /*!< QSPI triple-mode redundancy register */

#define CPDM_CTL                          REG32(CPDM_QSPI + 0x00000000U)       /*!< CPDM control register */
#define CPDM_CFG                          REG32(CPDM_QSPI + 0x00000004U)       /*!< CPDM configuration register */

/* bits definitions */
/* QSPI_CTL */
#define QSPI_CTL_QSPIEN                   BIT(0)                               /*!< enable QSPI */
#define QSPI_CTL_ABORT                    BIT(1)                               /*!< abort request */
#define QSPI_CTL_DMAEN                    BIT(2)                               /*!< enable DMA */
#define QSPI_CTL_TMOUTEN                  BIT(3)                               /*!< timeout counter enable */
#define QSPI_CTL_SSAMPLE                  BIT(4)                               /*!< sample shift */
#define QSPI_CTL_OCKDEN                   BIT(5)                               /*!< output clock delay is enabled when reading data from flash */
#define QSPI_CTL_FTL                      BITS(8,11)                           /*!< fifo threshold level */
#define QSPI_CTL_OCKDV                    BITS(12,15)                          /*!< output clock delay vlaue */
#define QSPI_CTL_TERRIE                   BIT(16)                              /*!< enable transfer error interrupt */
#define QSPI_CTL_TCIE                     BIT(17)                              /*!< enable transfer complete interrupt */
#define QSPI_CTL_FTIE                     BIT(18)                              /*!< enable fifo threshold interrupt */
#define QSPI_CTL_RPMFIE                   BIT(19)                              /*!< enable read polling mode match interrupt */
#define QSPI_CTL_TMOUTIE                  BIT(20)                              /*!< enable timeout interrupt */
#define QSPI_CTL_RPMS                     BIT(22)                              /*!< read polling mode stop */
#define QSPI_CTL_RPMM                     BIT(23)                              /*!< read polling match mode */
#define QSPI_CTL_PSC                      BITS(24,31)                          /*!< prescaler */

/* QSPI_DCFG */
#define QSPI_DCFG_CKMOD                   BIT(0)                               /*!< this bit indicates the sck level when qspi is free */
#define QSPI_DCFG_RXSFT                   BITS(1,3)                            /*!< shift receive step if receive data delay more than 0.5 cycle */
#define QSPI_DCFG_RCKSEL                  BIT(4)                               /*!< receive clock select */
#define QSPI_DCFG_DLYSCEN                 BIT(5)                               /*!< delay scan enable */
#define QSPI_DCFG_CSHC                    BITS(8,10)                           /*!< chip select high cycle */
#define QSPI_DCFG_FMSZ                    BITS(16,20)                          /*!< flash memory size */
#define QSPI_DCFG_CSNCKM                  BIT(30)                              /*!< CSN falls and rises one or two sck cycle select */

