sorosaulong-ux/gd32-test-project/Library/gd32a7xx_qspi.h
/* QSPI read polling struct definitions */
typedef struct {
    uint32_t match;                                                            /*!< specifies the value to be compared with the masked status register to get a match.
                                                                                    this parameter can be any value between 0 and 0xFFFFFFFF */
    uint32_t mask;                                                             /*!< specifies the mask to be applied to the status bytes received.
                                                                                    this parameter can be any value between 0 and 0xFFFFFFFF */
    uint32_t interval;                                                         /*!< specifies the number of clock cycles between two read during read polling phases.
                                                                                    this parameter can be any value between 0 and 0xFFFF */
    uint32_t statusbytes_size;                                                 /*!< specifies the size of the status bytes received.
                                                                                    this parameter can be any value between 1 and 4 */
    uint32_t match_mode;                                                       /*!< specifies the method used for determining a match. */
    uint32_t polling_stop;                                                     /*!< specifies if read polling is stopped after a match. */
} qspi_polling_struct;

/* QSPI flag definitions */
#define QSPI_FLAG_BUSY                    QSPI_STAT_BUSY                       /*!< busy flag */
#define QSPI_FLAG_TERR                    QSPI_STAT_TERR                       /*!< transfer error flag */
#define QSPI_FLAG_TC                      QSPI_STAT_TC                         /*!< transfer complete flag */
#define QSPI_FLAG_FT                      QSPI_STAT_FT                         /*!< fifo threshold flag */
#define QSPI_FLAG_RPMF                    QSPI_STAT_RPMF                       /*!< read polling match flag */
#define QSPI_FLAG_TMOUT                   QSPI_STAT_TMOUT                      /*!< timeout flag */

/* QSPI interrupt flag definitions */
#define QSPI_INT_FLAG_TERR                QSPI_STAT_TERR                       /*!< transfer error interrupt flag */
#define QSPI_INT_FLAG_TC                  QSPI_STAT_TC                         /*!< transfer complete interrupt flag */
#define QSPI_INT_FLAG_FT                  QSPI_STAT_FT                         /*!< fifo threshold interrupt flag */
#define QSPI_INT_FLAG_RPMF                QSPI_STAT_RPMF                       /*!< read polling match interrupt flag */
#define QSPI_INT_FLAG_TMOUT               QSPI_STAT_TMOUT                      /*!< timeout interrupt flag */

/* QSPI clock mode */
#define QSPI_CLOCK_MODE_LOW               ((uint32_t)0x00000000U)              /*!< QSPI clock must stay low when CSN is high */
#define QSPI_CLOCK_MODE_HIGH              QSPI_DCFG_CKMOD                      /*!< QSPI clock must stay high when CSN is high */

/* QSPI sample shift(more than 1/2) */
#define DCFG_SSAMPLE(regval)              (BITS(1,3) & ((uint32_t)(regval) << 1))
#define QSPI_SHIFTING_NONE                DCFG_SSAMPLE(0)                      /*!< no shift when sample data */
#define QSPI_SHIFTING_1_CYCLE             DCFG_SSAMPLE(1)                      /*!< 1 sck cycle shift when sample data */
#define QSPI_SHIFTING_2_CYCLE             DCFG_SSAMPLE(2)                      /*!< 2 sck cycle shift when sample data */
#define QSPI_SHIFTING_3_CYCLE             DCFG_SSAMPLE(3)                      /*!< 3 sck cycle shift when sample data */
#define QSPI_SHIFTING_4_CYCLE             DCFG_SSAMPLE(4)                      /*!< 4 sck cycle shift when sample data */
#define QSPI_SHIFTING_5_CYCLE             DCFG_SSAMPLE(5)                      /*!< 5 sck cycle shift when sample data */
#define QSPI_SHIFTING_6_CYCLE             DCFG_SSAMPLE(6)                      /*!< 6 sck cycle shift when sample data */
#define QSPI_SHIFTING_7_CYCLE             DCFG_SSAMPLE(7)                      /*!< 7 sck cycle shift when sample data */

/* QSPI clock mode */
#define QSPI_RECEIVE_CLOCK_SCK            ((uint32_t)0x00000000U)              /*!< QSPI receive clock choose sck */
#define QSPI_RECEIVE_CLOCK_DQS            QSPI_DCFG_RCKSEL                     /*!< QSPI receive clock choose dqs */

/* QSPI sample shift */
#define QSPI_SAMPLE_SHIFTING_NONE         ((uint32_t)0x00000000U)              /*!< no shift when sample data */
#define QSPI_SAMPLE_SHIFTING_HALFCYCLE    QSPI_CTL_SSAMPLE                     /*!< 1/2 sck cycle shift when sample data */

/* QSPI CSN cycle */
#define QSPI_CSN_1_CYCLE                  ((uint32_t)0x00000000U)              /*!< csn falls and rises 1 sck cycle */
#define QSPI_CSN_2_CYCLE                  QSPI_DCFG_CSNCKM                     /*!< csn falls and rises 2 sck cycle  */

/* QSPI chip select high cycle */
#define DCFG_CSHC(regval)                 (BITS(8,10) & ((uint32_t)(regval) << 8))
#define QSPI_CS_HIGH_TIME_1_CYCLE         DCFG_CSHC(0)                         /*!< QSPI CS stays high for at least 1 cycle */
#define QSPI_CS_HIGH_TIME_2_CYCLE         DCFG_CSHC(1)                         /*!< QSPI CS stays high for at least 2 cycles */
#define QSPI_CS_HIGH_TIME_3_CYCLE         DCFG_CSHC(2)                         /*!< QSPI CS stays high for at least 3 cycles */
#define QSPI_CS_HIGH_TIME_4_CYCLE         DCFG_CSHC(3)                         /*!< QSPI CS stays high for at least 4 cycles */
#define QSPI_CS_HIGH_TIME_5_CYCLE         DCFG_CSHC(4)                         /*!< QSPI CS stays high for at least 5 cycles */
#define QSPI_CS_HIGH_TIME_6_CYCLE         DCFG_CSHC(5)                         /*!< QSPI CS stays high for at least 6 cycles */
#define QSPI_CS_HIGH_TIME_7_CYCLE         DCFG_CSHC(6)                         /*!< QSPI CS stays high for at least 7 cycles */
#define QSPI_CS_HIGH_TIME_8_CYCLE         DCFG_CSHC(7)                         /*!< QSPI CS stays high for at least 8 cycles */

/* QSPI instruction mode */
#define TCFG_IMODE(regval)                (BITS(8,9) & ((uint32_t)(regval) << 8))
#define QSPI_INSTRUCTION_NONE             TCFG_IMODE(0)                        /*!< no instruction */
#define QSPI_INSTRUCTION_1_LINE           TCFG_IMODE(1)                        /*!< instruction on a single line */
#define QSPI_INSTRUCTION_2_LINES          TCFG_IMODE(2)                        /*!< instruction on two lines */
#define QSPI_INSTRUCTION_4_LINES          TCFG_IMODE(3)                        /*!< instruction on four lines */

/* QSPI address mode */
#define TCFG_ADDRMOD(regval)              (BITS(10,11) & ((uint32_t)(regval) << 10))
#define QSPI_ADDR_NONE                    TCFG_ADDRMOD(0)                      /*!< no address */
#define QSPI_ADDR_1_LINE                  TCFG_ADDRMOD(1)                      /*!< address on a single line */
#define QSPI_ADDR_2_LINES                 TCFG_ADDRMOD(2)                      /*!< address on two lines */
#define QSPI_ADDR_4_LINES                 TCFG_ADDRMOD(3)                      /*!< address on four lines */

/* QSPI address size */
#define TCFG_ADDRSZ(regval)               (BITS(12,13) & ((uint32_t)(regval) << 12))
#define QSPI_ADDR_8_BITS                  TCFG_ADDRSZ(0)                       /*!< 8 bits address */
#define QSPI_ADDR_16_BITS                 TCFG_ADDRSZ(1)                       /*!< 16 bits address */
#define QSPI_ADDR_24_BITS                 TCFG_ADDRSZ(2)                       /*!< 24 bits address */
#define QSPI_ADDR_32_BITS                 TCFG_ADDRSZ(3)                       /*!< 32 bits address */

/* QSPI alternate bytes mode */
#define TCFG_ALTEMOD(regval)              (BITS(14,15) & ((uint32_t)(regval) << 14))
#define QSPI_ALTE_BYTES_NONE              TCFG_ALTEMOD(0)                      /*!< no alternate bytes */
#define QSPI_ALTE_BYTES_1_LINE            TCFG_ALTEMOD(1)                      /*!< alternate bytes on a single line */
#define QSPI_ALTE_BYTES_2_LINES           TCFG_ALTEMOD(2)                      /*!< alternate bytes on two lines */
#define QSPI_ALTE_BYTES_4_LINES           TCFG_ALTEMOD(3)                      /*!< alternate bytes on four lines */

/* QSPI alternate bytes size */
#define TCFG_ALTESZ(regval)               (BITS(16,17) & ((uint32_t)(regval) << 16))
#define QSPI_ALTE_BYTES_8_BITS            TCFG_ALTESZ(0)                       /*!< 8 bits alternate byte */
#define QSPI_ALTE_BYTES_16_BITS           TCFG_ALTESZ(1)                       /*!< 16 bits alternate bytes */
#define QSPI_ALTE_BYTES_24_BITS           TCFG_ALTESZ(2)                       /*!< 24 bits alternate bytes */
#define QSPI_ALTE_BYTES_32_BITS           TCFG_ALTESZ(3)                       /*!< 32 bits alternate bytes */

/* QSPI data mode */
#define TCFG_DATAMOD(regval)              (BITS(24,25) & ((uint32_t)(regval) << 24))
#define QSPI_DATA_NONE                    TCFG_DATAMOD(0)                      /*!< no data */
#define QSPI_DATA_1_LINE                  TCFG_DATAMOD(1)                      /*!< data on a single line */
#define QSPI_DATA_2_LINES                 TCFG_DATAMOD(2)                      /*!< data on two lines */
#define QSPI_DATA_4_LINES                 TCFG_DATAMOD(3)                      /*!< data on four lines */

