sorosaulong-ux/gd32-test-project/Library/gd32a7xx_qspi.h
/* QSPI functional mode */
#define TCFG_FMOD(regval)                 (BITS(26,27) & ((uint32_t)(regval) << 26))
#define QSPI_NORMAL_WRITE                 TCFG_FMOD(0)                         /*!< normal write mode */
#define QSPI_NORMAL_READ                  TCFG_FMOD(1)                         /*!< normal read mode */
#define QSPI_READ_POLLING                 TCFG_FMOD(2)                         /*!< read polling mode */
#define QSPI_MEMORY_MAPPED                TCFG_FMOD(3)                         /*!< memory mapped mode */

/* QSPI sioo mode */
#define QSPI_SIOO_INST_EVERY_CMD          ((uint32_t)0x00000000U)              /*!< send instruction on every command sequence */
#define QSPI_SIOO_INST_ONLY_FIRST_CMD     QSPI_TCFG_SIOO                       /*!< send instruction only for the first command sequence */

/* QSPI ddr mode */
#define QSPI_SDR_MODE                     ((uint32_t)0x00000000U)              /*!< single data rate */
#define QSPI_DDR_MODE                     QSPI_TCFG_DDREN                      /*!< double data rate */

/* QSPI ddr output hold */
#define QSPI_DDR_HOLD_DISABLE             ((uint32_t)0x00000000U)              /*!< disable ddr output hold */
#define QSPI_DDR_HOLD_ENABLE              QSPI_TCFG_DDRHEN                     /*!< enable ddr output hold */

/* QSPI timeout count */
#define QSPI_TMOUT_DISABLE                ((uint32_t)0x00000000U)              /*!< disable timeout counter */
#define QSPI_TMOUT_ENABLE                 QSPI_CTL_TMOUTEN                     /*!< enable timeout counter */

/* QSPI match mode */
#define QSPI_MATCH_MODE_AND               ((uint32_t)0x00000000U)              /*!< and match mode */
#define QSPI_MATCH_MODE_OR                QSPI_CTL_RPMM                        /*!< or match mode */

/* QSPI read polling stop */
#define QSPI_POLLING_STOP_DISABLE         ((uint32_t)0x00000000U)              /*!< disable read polling mode stop */
#define QSPI_POLLING_STOP_ENABLE          QSPI_CTL_RPMS                        /*!< enable read polling mode stop */

/* QSPI interrupt */
#define QSPI_INT_TC                       QSPI_CTL_TCIE                        /*!< transfer complete interrupt */
#define QSPI_INT_FT                       QSPI_CTL_FTIE                        /*!< FIFO threshold interrupt */
#define QSPI_INT_TERR                     QSPI_CTL_TERRIE                      /*!< transfer error interrupt */
#define QSPI_INT_RPMF                     QSPI_CTL_RPMFIE                      /*!< read polling match interrupt */
#define QSPI_INT_TMOUT                    QSPI_CTL_TMOUTIE                     /*!< timeout interrupt */

/* QSPI prescaler */
#define QSPI_MAX_PRESCALER                    ((uint32_t)0x00000100U)               /*!< Max QSPI prescaler  */

/* QSPI fifo threahold */
#define QSPI_MAX_FIFO_THREAHOLD               ((uint32_t)0x00000010U)               /*!< Max QSPI fifo threahold  */

/* QSPI flash size */
#define QSPI_MAX_FLASH_SIZE                   ((uint32_t)0x0000001CU)               /*!< Max QSPI flash size  */
#define QSPI_MIN_FLASH_SIZE                   ((uint32_t)0x00000000U)               /*!< Min QSPI flash size  */

/* QSPI instruction */
#define QSPI_MAX_INSTRUCTIN                   ((uint32_t)0x000000FFU)               /*!< Max QSPI instruction  */
#define QSPI_MIN_INSTRUCTIN                   ((uint32_t)0x00000000U)               /*!< Min QSPI instruction  */

/* QSPI dumycycles */
#define QSPI_MAX_DUMMYCYCLES                   ((uint32_t)0x0000001FU)               /*!< Max QSPI dumycycles  */
#define QSPI_MIN_DUMMYCYCLES                   ((uint32_t)0x00000000U)               /*!< Min QSPI dumycycles  */

/* QSPI match value */
#define QSPI_MAX_MATCH_VALUE                   ((uint32_t)0xFFFFFFFFU)               /*!< Max QSPI match value  */
#define QSPI_MIN_MATCH_VALUE                   ((uint32_t)0x00000000U)               /*!< Min QSPI match value  */

/* QSPI mask value */
#define QSPI_MAX_MASK_VALUE                   ((uint32_t)0xFFFFFFFFU)               /*!< Max QSPI mask value  */
#define QSPI_MIN_MASK_VALUE                   ((uint32_t)0x00000000U)               /*!< Min QSPI mask value  */

/* QSPI clock cycles */
#define QSPI_MAX_CLK_CYC                      ((uint32_t)0x0000FFFFU)               /*!< Max QSPI clock cycles  */
#define QSPI_MIN_CLK_CYC                      ((uint32_t)0x00000000U)               /*!< Min QSPI clock cycles  */

/* QSPI phase */
#define QSPI_MAX_PHASE                         ((uint32_t)0x0000000CU)               /*!< Max QSPI phase  */
#define QSPI_MIN_PHASE                         ((uint32_t)0x00000000U)               /*!< Min QSPI phase  */

/* QSPI statusbytes size */
#define QSPI_MAX_SATUSBYTES_SIZE               ((uint32_t)0x00000004U)               /*!< Max QSPI statusbytes size  */
#define QSPI_MIN_SATUSBYTES_SIZE               ((uint32_t)0x00000000U)               /*!< Min QSPI statusbytes size  */

/* QSPI timeout */
#define QSPI_MAX_TIMEOUT                       ((uint32_t)0x0000FFFFU)               /*!< Max QSPI timeout  */
#define QSPI_MIN_TIMEOUT                       ((uint32_t)0x00000000U)               /*!< Min QSPI timeout  */

/* CPDM delay step count */
#define CPDM_MAX_DELAY_STEP_COUNT              ((uint32_t)0x0000007FU)               /*!< Max CPDM delay step count  */
#define CPDM_MIN_DELAY_STEP_COUNT              ((uint32_t)0x00000000U)               /*!< Min CPDM delay step count  */

/* CPDM phase */
#define CPDM_MAX_PHASE                         ((uint32_t)0x0000000CU)               /*!< Max Select value of the phase */
#define CPDM_MIN_PHASE                         ((uint32_t)0x00000000U)               /*!< Min Select value of the phase */

/* QSPI interrupt */
#define CLOCK_DELAY_VALUE_HIGH                 ((uint32_t)0x0000000FU)               /*!< Max clock delay value  */
#define CLOCK_DELAY_VALUE_LOW                  ((uint32_t)0x00000000U)               /*!< Min clock delay value */

/* QSPI command config timeout */
#define QSPI_COMMAND_CONFIG_TOMEOUT            ((uint16_t)0x0FFFFU)                  /*!< command config timeout */

/* QSPI data transmit timeout */
#define QSPI_DATA_TRANSMIT_TOMEOUT             ((uint16_t)0x0FFFFU)                  /*!< data transmi timeout */

/* QSPI data receive timeout */
#define QSPI_DATA_RECEIVE_TOMEOUT              ((uint16_t)0x0FFFFU)                  /*!< data receive timeout */

/* QSPI data abort timeout */
#define QSPI_DATA_ABORT_TOMEOUT                ((uint16_t)0x0FFFFU)                  /*!< data abort timeout */

#define QSPI_TMRALM_CTL_FLAG                   QSPI_TMR_ST0                          /*!< QSPI_CTL register triple-mode redundancy alarm flag */
#define QSPI_TMRALM_DTLEN_FLAG                 QSPI_TMR_ST1                          /*!< QSPI_DTLEN register triple-mode redundancy alarm flag */
#define QSPI_TMRALM_TCFG_FLAG                  QSPI_TMR_ST2                          /*!< QSPI_TCFG register triple-mode redundancy alarm flag */
#define QSPI_TMRALM_FLUSH_FLAG                 QSPI_TMR_ST3                          /*!< QSPI_FLUSH register triple-mode redundancy alarm flag */

#define QSPI_TMRALM_CTL                        QSPI_TMR_EN0                          /*!< QSPI_CTL register triple-mode redundancy alarm enable */
#define QSPI_TMRALM_DTLEN                      QSPI_TMR_EN1                          /*!< QSPI_DTLEN register triple-mode redundancy alarm enable */
#define QSPI_TMRALM_TCFG                       QSPI_TMR_EN2                          /*!< QSPI_TCFG register triple-mode redundancy alarm enable */
#define QSPI_TMRALM_FLUSH                      QSPI_TMR_EN3                          /*!< QSPI_FLUSH register triple-mode redundancy alarm enable */

/* output clock phase selection enum definition */
typedef enum {
    CPDM_OUTPUT_PHASE_SELECTION_0 = 0U,                            /*!< output clock phase = input clock */
    CPDM_OUTPUT_PHASE_SELECTION_1,                                 /*!< output clock phase = input clock + 1 * UNIT delay */
    CPDM_OUTPUT_PHASE_SELECTION_2,                                 /*!< output clock phase = input clock + 2 * UNIT delay */
    CPDM_OUTPUT_PHASE_SELECTION_3,                                 /*!< output clock phase = input clock + 3 * UNIT delay */
    CPDM_OUTPUT_PHASE_SELECTION_4,                                 /*!< output clock phase = input clock + 4 * UNIT delay */
    CPDM_OUTPUT_PHASE_SELECTION_5,                                 /*!< output clock phase = input clock + 5 * UNIT delay */
    CPDM_OUTPUT_PHASE_SELECTION_6,                                 /*!< output clock phase = input clock + 6 * UNIT delay */
    CPDM_OUTPUT_PHASE_SELECTION_7,                                 /*!< output clock phase = input clock + 7 * UNIT delay */
    CPDM_OUTPUT_PHASE_SELECTION_8,                                 /*!< output clock phase = input clock + 8 * UNIT delay */
    CPDM_OUTPUT_PHASE_SELECTION_9,                                 /*!< output clock phase = input clock + 9 * UNIT delay */
    CPDM_OUTPUT_PHASE_SELECTION_10,                                /*!< output clock phase = input clock + 10 * UNIT delay */
    CPDM_OUTPUT_PHASE_SELECTION_11,                                /*!< output clock phase = input clock + 11 * UNIT delay */
    CPDM_OUTPUT_PHASE_SELECTION_12,                                /*!< output clock phase = input clock + 12 * UNIT delay */
} cpdm_output_phase_enum;

