sorosaulong-ux/gd32-test-project/Library/gd32a7xx_qspi.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check QSPI prescaler */
#define NOT_QSPI_PRESCALER(prescaler)                        ((prescaler) > QSPI_MAX_PRESCALER)
/* check QSPI fifo threshold */
#define NOT_QSPI_FIFO_THREAHOLD(fifo_threshold)              ((fifo_threshold) > QSPI_MAX_FIFO_THREAHOLD)
/* check QSPI sample shift */
#define NOT_QSPI_SAMPLE_SHIFT(sample_shift)                  (((sample_shift) != QSPI_SAMPLE_SHIFTING_NONE) && ((sample_shift) != QSPI_SAMPLE_SHIFTING_HALFCYCLE))
/* check QSPI flash size */
#define NOT_QSPI_FLASH_SIZE(flash_size)                      ((flash_size) > QSPI_MAX_FLASH_SIZE)
/* check QSPI cs high time */
#define NOT_QSPI_CS_HIGH_TIME(cs_high_time)                  (((cs_high_time) != QSPI_CS_HIGH_TIME_1_CYCLE) && ((cs_high_time) != QSPI_CS_HIGH_TIME_2_CYCLE) && \
                                                              ((cs_high_time) != QSPI_CS_HIGH_TIME_3_CYCLE) && ((cs_high_time) != QSPI_CS_HIGH_TIME_4_CYCLE) && \
                                                              ((cs_high_time) != QSPI_CS_HIGH_TIME_5_CYCLE) && ((cs_high_time) != QSPI_CS_HIGH_TIME_6_CYCLE) && \
                                                              ((cs_high_time) != QSPI_CS_HIGH_TIME_7_CYCLE) && ((cs_high_time) != QSPI_CS_HIGH_TIME_8_CYCLE))
/* check QSPI clock mode */
#define NOT_QSPI_CLOCK_MODE(clock_mode)                      (((clock_mode) != QSPI_CLOCK_MODE_LOW) && ((clock_mode) != QSPI_CLOCK_MODE_HIGH))
/* check QSPI instruction mode */
#define NOT_QSPI_INSTRUCTIN_MODE(instruction_mode)           (((instruction_mode) != QSPI_INSTRUCTION_NONE) && ((instruction_mode) != QSPI_INSTRUCTION_1_LINE) && \
                                                              ((instruction_mode) != QSPI_INSTRUCTION_2_LINES) && ((instruction_mode) != QSPI_INSTRUCTION_4_LINES))
/* check QSPI instruction */
#define NOT_QSPI_INSTRUCTIN(instruction)                     ((instruction) > QSPI_MAX_INSTRUCTIN)
/* check QSPI addr mode */
#define NOT_QSPI_ADDR_MODE(addr_mode)                        (((addr_mode) != QSPI_ADDR_NONE) && ((addr_mode) != QSPI_ADDR_1_LINE) && \
                                                              ((addr_mode) != QSPI_ADDR_2_LINES) && ((addr_mode) != QSPI_ADDR_4_LINES))
/* check QSPI addr size */
#define NOT_QSPI_ADDR_SIZE(addr_size)                        (((addr_size) != QSPI_ADDR_8_BITS) && ((addr_size) != QSPI_ADDR_16_BITS) && \
                                                              ((addr_size) != QSPI_ADDR_24_BITS) && ((addr_size) != QSPI_ADDR_32_BITS))
/* check QSPI altebytes mode */
#define NOT_QSPI_ALTEBYTES_MODE(altebytes_mode)              (((altebytes_mode) != QSPI_ALTE_BYTES_NONE) && ((altebytes_mode) != QSPI_ALTE_BYTES_1_LINE) && \
                                                              ((altebytes_mode) != QSPI_ALTE_BYTES_2_LINES) && ((altebytes_mode) != QSPI_ALTE_BYTES_4_LINES))
/* check QSPI altebytes size */
#define NOT_QSPI_ALTEBYTES_SIZE(altebytes_size)              (((altebytes_size) != QSPI_ALTE_BYTES_8_BITS) && ((altebytes_size) != QSPI_ALTE_BYTES_16_BITS) && \
                                                              ((altebytes_size) != QSPI_ALTE_BYTES_24_BITS) && ((altebytes_size) != QSPI_ALTE_BYTES_32_BITS))
/* check QSPI dummycycles */
#define NOT_QSPI_DUMMYCYCLES(dummycycles)                    ((dummycycles) > QSPI_MAX_DUMMYCYCLES)
/* check QSPI data mode */
#define NOT_QSPI_DATA_MODE(data_mode)                        (((data_mode) != QSPI_DATA_NONE) && ((data_mode) != QSPI_DATA_1_LINE) && \
                                                              ((data_mode) != QSPI_DATA_2_LINES) && ((data_mode) != QSPI_DATA_4_LINES))
/* check QSPI sioo mode */
#define NOT_QSPI_SIOO_MODE(sioo_mode)                        (((sioo_mode) != QSPI_SIOO_INST_EVERY_CMD) && ((sioo_mode) != QSPI_SIOO_INST_ONLY_FIRST_CMD))
/* check QSPI trans rate */
#define NOT_QSPI_TRANS_RATE(trans_rate)                      (((trans_rate) != QSPI_SDR_MODE) && ((trans_rate) != QSPI_DDR_MODE))
/* check QSPI trans delay */
#define NOT_QSPI_TRANS_DELAY(trans_delay)                    (((trans_delay) != QSPI_DDR_HOLD_DISABLE) && ((trans_delay) != QSPI_DDR_HOLD_ENABLE))
/* check QSPI functional mode */
#define NOT_QSPI_FUNCTIONAL_MODE(functionalmode)             (((functionalmode) != QSPI_NORMAL_WRITE) && ((functionalmode) != QSPI_NORMAL_READ) && \
                                                              ((functionalmode) != QSPI_READ_POLLING) && ((functionalmode) != QSPI_MEMORY_MAPPED))
/* check QSPI phase */
#define NOT_QSPI_PHASE(phase)                                (((phase)< QSPI_MIN_PHASE) || ((phase) > QSPI_MAX_PHASE))
/* check QSPI number of match value */
#define NOT_QSPI_MATCH_VALUE(match)                          ((match) < QSPI_MAX_MATCH_VALUE)
/* check QSPI number of mask value */
#define NOT_QSPI_MASK_VALUE(mask)                            ((mask) < QSPI_MAX_MASK_VALUE)
/* check QSPI number of clock cycles */
#define NOT_QSPI_NUM_CLK_CYC(interval)                       ((interval) > QSPI_MAX_CLK_CYC)
/* check QSPI statusbytes size */
#define NOT_QSPI_SATUSBYTES_SIZE(statusbytes_size)           ((statusbytes_size) > QSPI_MAX_SATUSBYTES_SIZE)
/* check QSPI match mode */
#define NOT_QSPI_MATCH_MODE(match_mode)                      (((match_mode) != QSPI_MATCH_MODE_AND) && ((match_mode) != QSPI_MATCH_MODE_OR))
/* check QSPI polling stop */
#define NOT_QSPI_POLLING_STOP(polling_stop)                  (((polling_stop) != QSPI_POLLING_STOP_DISABLE) && ((polling_stop) != QSPI_POLLING_STOP_ENABLE))
/* check QSPI timeout */
#define NOT_QSPI_TIMEOUT(timeout)                            ((timeout) < QSPI_MAX_TIMEOUT)
/* check QSPI timeout count */
#define NOT_QSPI_TIMEOUT_COUNT(toen)                         (((toen) != QSPI_TMOUT_DISABLE) && ((toen) != QSPI_TMOUT_ENABLE))
/* check QSPI clock delay value */
#define NOT_QSPI_CLOCK_DELAY(clock_delay)                    ((clock_delay) >CLOCK_DELAY_VALUE_HIGH)
/* check QSPI sample shift1 */
#define NOT_QSPI_SAMPLE_SHIFT1(sample_shift1)                (((sample_shift1) != QSPI_SAMPLE_SHIFTING_NONE) && ((sample_shift1) != QSPI_SAMPLE_SHIFTING_HALFCYCLE))
/* check QSPI sample shift2 */
#define NOT_QSPI_SAMPLE_SHIFT2(sample_shift2)                (((sample_shift2) != QSPI_SHIFTING_NONE) && ((sample_shift2) != QSPI_SHIFTING_1_CYCLE) && \
                                                              ((sample_shift2) != QSPI_SHIFTING_2_CYCLE) && ((sample_shift2) != QSPI_SHIFTING_3_CYCLE) && \
                                                              ((sample_shift2) != QSPI_SHIFTING_4_CYCLE) && ((sample_shift2) != QSPI_SHIFTING_5_CYCLE) && \
                                                              ((sample_shift2) != QSPI_SHIFTING_6_CYCLE) && ((sample_shift2) != QSPI_SHIFTING_7_CYCLE))
/* check QSPI receive clock select */
#define NOT_QSPI_RCKSEL(rcksel)                              (((rcksel) != QSPI_RECEIVE_CLOCK_SCK) && ((rcksel) != QSPI_RECEIVE_CLOCK_DQS))
/* check QSPI CSN clock select */
#define NOT_QSPI_CSN_CLOCK(csn_cycle)                        (((csn_cycle) != QSPI_CSN_1_CYCLE) && ((csn_cycle) != QSPI_CSN_2_CYCLE))
/* check QSPI FLAG CLEAR*/
#define NOT_QSPI_FLAG_CLEAR(flag)                             (((flag) != QSPI_FLAG_TERR) && ((flag) != QSPI_FLAG_TC) && \
                                                              ((flag) != QSPI_FLAG_RPMF) && ((flag) != QSPI_FLAG_TMOUT))
/* check QSPI FLAG */
#define NOT_QSPI_FLAG(flag)                                  (((flag) != QSPI_FLAG_BUSY) && ((flag) != QSPI_FLAG_TERR) && \
                                                              ((flag) != QSPI_FLAG_TC) && ((flag) != QSPI_FLAG_FT) && \
                                                              ((flag) != QSPI_FLAG_RPMF) && ((flag) != QSPI_FLAG_TMOUT))
/* check QSPI INTERRUPT FLAG CLEAR*/
#define NOT_QSPI_INTERRUPT_FLAG_CLEAR(int_flag)               (((int_flag) != QSPI_INT_FLAG_TC)&&((int_flag) != QSPI_INT_FLAG_TERR) && \
                                                               ((int_flag) != QSPI_INT_FLAG_RPMF) && ((int_flag) != QSPI_INT_FLAG_TMOUT))
/* check QSPI INTERRUPT  */
#define NOT_QSPI_INTERRUPT(interrupt)                        (((interrupt) != QSPI_INT_TC) && ((interrupt) != QSPI_INT_FT) && \
                                                              ((interrupt) != QSPI_INT_TERR) && ((interrupt) != QSPI_INT_RPMF) && \
                                                              ((interrupt) != QSPI_INT_TMOUT))
/* check QSPI INTERRUPT FLAG */
#define NOT_QSPI_INTERRUPT_FLAG(int_flag)                    (((int_flag) != QSPI_INT_FLAG_TC) && ((int_flag) != QSPI_INT_FLAG_FT) && \
                                                              ((int_flag) != QSPI_INT_FLAG_TERR) && ((int_flag) != QSPI_INT_FLAG_RPMF) && \
                                                              ((int_flag) != QSPI_INT_FLAG_TMOUT))
/* check CPDM delay step count */
#define NOT_CPDM_DELAY_STEP_COUNT(units)                     ((units) > CPDM_MAX_DELAY_STEP_COUNT)
/* check QSPI TMR alarm status */
#define NOT_QSPI_TMRALARM_STATUS(tmr_alarm)                  (((tmr_alarm) != QSPI_TMRALM_CTL_FLAG) && ((tmr_alarm) != QSPI_TMRALM_DTLEN_FLAG) && \
                                                              ((tmr_alarm) != QSPI_TMRALM_TCFG_FLAG) && ((tmr_alarm) != QSPI_TMRALM_FLUSH_FLAG))
/* check QSPI TMR alarm status clear */
#define NOT_QSPI_TMRALARM_STATUS_CLEAR(tmr_alarm)            ((((tmr_alarm) & 0xFFFFFF55U) != 0U) || ((tmr_alarm) == 0U))
/* check QSPI TMR alarm enable */
#define NOT_QSPI_TMRALARM_EN(tmr_alarm)                      ((((tmr_alarm) & 0xFFFFFFAAU) != 0U) || ((tmr_alarm) == 0U))

#endif
/* function declarations */
/* initialization functions */
/* reset QSPI */
void qspi_deinit(void);
/* initialize the parameters of QSPI init struct with the default values */
void qspi_struct_para_init(qspi_init_struct *init_para);
/* initialize the parameters of QSPI command struct with the default values */
void qspi_cmd_struct_para_init(qspi_command_struct *init_para);
/* initialize the parameters of QSPI read polling struct with the default values */
void qspi_polling_struct_para_init(qspi_polling_struct *init_para);
/* initialize QSPI parameter */
void qspi_init(qspi_init_struct *qspi_struct);
/* enable QSPI */
void qspi_enable(void);
/* disable QSPI */
void qspi_disable(void);
/* enable QSPI DMA */
void qspi_dma_enable(void);
/* disable QSPI DMA */
void qspi_dma_disable(void);

/* application function declarations */
/* configure QSPI command parameters */
void qspi_command_config(qspi_command_struct *cmd);
/* configure QSPI read polling mode */
void qspi_polling_config(qspi_command_struct *cmd, qspi_polling_struct *cfg);
/* configure QSPI memory mapped mode */
void qspi_memorymapped_config(qspi_command_struct *cmd, uint16_t timeout, uint32_t toen);
/* QSPI transmit data function */
void qspi_data_transmit(uint8_t *tdata);
/* QSPI receive data function */
void qspi_data_receive(uint8_t *rdata);
/* abort the current transmission */
void qspi_transmission_abort(void);
/* enable output clock delay */
void qspi_output_clock_delay_enable(void);
/* disable output clock delay */
void qspi_output_clock_delay_disable(void);
/* configure output clock delay */
void qspi_output_clock_delay_config(uint32_t ck_delay);
/* config qspi sample shift */
void qspi_sample_shift_config(uint32_t sample_shift1, uint32_t sample_shift2);
/* select qspi receive clock */
void qspi_receive_clock_sel(uint32_t rcksel);
/* enable delay scan */
void qspi_delay_scan_enable(void);
/* disable delay scan */
void qspi_delay_scan_disable(void);
/* select csn falls and rises 1 or 2 sck cycles */
void qspi_csn_edge_cycle(uint32_t csn_cycle);

/* interrupt & flag functions */
/* get QSPI flag status */
FlagStatus qspi_flag_get(uint32_t flag);
/* clear QSPI flag status */
void qspi_flag_clear(uint32_t flag);
/* enable QSPI interrupt */
void qspi_interrupt_enable(uint32_t interrupt);
/* disable QSPI interrupt */
void qspi_interrupt_disable(uint32_t interrupt);
/* get QSPI interrupt flag status */
FlagStatus qspi_interrupt_flag_get(uint32_t int_flag);
/* clear QSPI interrupt flag status */
void qspi_interrupt_flag_clear(uint32_t int_flag);

/* deinitialization and initialization CPDM functions */
/* enable CPDM */
void cpdm_enable(void);
/* disable CPDM */
void cpdm_disable(void);
/* enable CPDM delay line sample module */
void cpdm_delayline_sample_enable(void);
/* disable CPDM delay line sample module */
void cpdm_delayline_sample_disable(void);

/* CPDM output clock configuration functions */
/* select CPDM output clock phase */
void cpdm_output_clock_phase_select(cpdm_output_phase_enum output_clock_phase);
/* configure CPDM delay step */
void cpdm_delay_step_config(uint8_t delay_step);
/* get delay line length valid flag */
FlagStatus cpdm_delayline_length_valid_flag_get(void);
/* get delay line length */
uint16_t cpdm_delayline_length_get(void);

/* CPDM clock output function */
/* configure CPDM clock output */
ErrStatus cpdm_clock_output(cpdm_output_phase_enum output_clock_phase);

/* QSPI triple mode redundancy (TMR) alarm functions */
/* get QSPI TMR alarm status */
FlagStatus qspi_tmr_alarm_status_get(uint32_t tmr_alarm);
/* clear QSPI TMR alarm status */
void qspi_tmr_alarm_status_clear(uint32_t tmr_alarm);
/* enable QSPI TMR alarm */
void qspi_tmr_alarm_enable(uint32_t tmr_alarm);
/* disable QSPI TMR alarm */
void qspi_tmr_alarm_disable(uint32_t tmr_alarm);

#endif /* GD32A7XX_QSPI_H */